Revit 2024 API
StairsComponentConnection Members
The StairsComponentConnection type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the StairsComponentConnection
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ConnectionType
 The connection type of the connected stairs component.
ElementId
 The element Id of connected stairs component in the stairs connection.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
PeerConnectionType
 The connection type of the peer connected stairs component.
PeerElementId
 The element Id of peer connected stairs component in the stairs connection.
See Also
StairsComponentConnection Class
Autodesk.Revit.DB.Architecture Namespace